### Python Library for data Analysis
### PAndas -Data Analysis
   - Series Object 
   - Updating DataFrame
   - Writing Dataframe back to csv file

In [242]:
## Funtion to read csv data into a dataframe
# return the Data Frame object
import pandas as pd
filepath='DataFiles/income.csv'
def readcsvdata(filepath):
    return pd.read_csv(filepath)
readcsvdata(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [243]:
# Funtion to print all column names in a single line
# GEOID States 2005 2006 2007 2008 2009 2010 2011 2012 2013
incomedf=readcsvdata(filepath)
def printDataframeColumns(df):
    columns=df.columns
    for column in columns:
        print(column, end = ' ')
    return 
printDataframeColumns(incomedf)

GEOID State 2005 2006 2007 2008 2009 2010 2011 2012 2013

In [244]:
# Funtion to Access a row based  on  a unique column value
def accessDataFrameRow(df,key):
    for row in df.values:
        if key in row:
            for item in row:
                print(item,end=' ' )      
    return 
accessDataFrameRow(incomedf,"04000US06")

04000US06 California 51755 55319 55734 57014 56134 54283 53367 57020 57528

In [245]:
def getrowindex(df,rowkey):
    for i in range(len(df.values)):
        if df.values[i][0]==rowkey or df.values[i][1]== rowkey:
            rowindex=i
    return rowindex
getrowindex(incomedf,'California')

4

In [246]:
# Accessing Unique value based on row ,column information
# Income of a state in a given year
def getrowindex(df,rowkey):
    for i in range(len(df.values)):
        if df.values[i][0]==rowkey or df.values[i][1]== rowkey:
            rowindex=i
    return rowindex
def getcolumnindex(df,columnkey):
    for i in range(len(df.columns)):
        if df.columns[i]==columnkey:
            columnindex = i
    return columnindex
def valueFromRowColumn(df,rowkey,columnkey):
#     for i in range(len(df.values)):
#         if df.values[i][0]==rowkey or df.values[i][1]== rowkey:
#             rowindex=i
#     for i in range(len(df.columns)):
#         if df.columns[i]==columnkey:
#             columnindex = i
    return df.values[getrowindex(df,rowkey)][getcolumnindex(df,columnkey)]
valueFromRowColumn(incomedf,'California','2009')

56134

In [247]:
def updateDtafromRowColumn(df,rowkey,columnkey,newincome):
    rowindex=getrowindex(df,rowkey)
    columnindex=getcolumnindex(df, columnkey)
    row=df.values[rowindex]
    row[columnindex]=newincome
    df.loc[rowindex]=row
    return 
updateDtafromRowColumn(incomedf,'California','2007',55734)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [248]:
accessDataFrameRow(incomedf,629933)

In [249]:
# Funtion to write dataframe to csv
incomedf.to_csv(filepath,index=False)

In [250]:
# Funtion to add a new row of data to dataframe
def addrowdataDataframe(df,rowdata):
    lastrowindex=len(df.values)-1
    df.loc[lastrowindex+1]=rowdata
rowdata=[1,2,3,4,5,6,7,8,9,10,11]
addrowdataDataframe(incomedf,rowdata)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528
5,1,2,3,4,5,6,7,8,9,10,11

In [251]:
# Funtion to delete a row in a datafram
def deleteRowDataframe(df,rowkey):
    rowindex = getrowindex(df,rowkey)
    return df.drop(rowindex)
incomedf=deleteRowDataframe(incomedf,1)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [252]:
l=list(incomedf['2005'])
l

[37150, 55891, 45245, 36658, 51755]

In [253]:
incomedf=readcsvdata(filepath)
l=[]
def Columns(df):
    columns=df.columns
    for column in columns:
        if(int(column)>=int(lb)):
            print(column, end = ' ')
        l.append(column)
    return 
printDataframeColumns(incomedf)

GEOID State 2005 2006 2007 2008 2009 2010 2011 2012 2013

In [254]:
def coldata(df):
    l=[]
    columns=df.columns
    for column in columns:
        for item in column:
            if(str(item).isnumeric())==True:
                l.append(column)
    return list(set(l))
l=coldata(incomedf)
l

['2006', '2008', '2010', '2011', '2012', '2013', '2007', '2005', '2009']

In [255]:
def countnoofrows(df):
    c=0
    for row in df.values:
        c+=1    
    return c
countnoofrows(incomedf)

5

In [256]:
def sumofallyearsincomdata(incomedf):
    s=0
    for i in range(len(l)):
        s=s+sum(list(incomedf[l[i]]))
    return s
sumofallyearsincomdata(incomedf)

2183644

In [257]:
def Averageincomeofallstates2005to2013(s,c):
    return s//c
Averageincomeofallstates2005to2013(sumofallyearsincomdata(incomedf),countnoofrows(incomedf))

436728

In [258]:
def getcolumnindex(df,columnkey):
    for i in range(len(df.columns)):
        if df.columns[i]==columnkey:
            columnindex = i
    return columnindex

c1=getcolumnindex(incomedf,'2007')
c2=getcolumnindex(incomedf,'2010')
print(c1)
print(c2)

4
7

In [259]:
l=[]
for i in range(len(incomedf.values)):
        s=0
        for j in range(c1,c2+1):
            print(incomedf.values[i][j],end=' ')
            s+=incomedf.values[i][j]
        a=s//c2-c1+1
        l.append(a)
        print()
print(l)
min(l)

42212 44476 39980 40933
62993 63989 61604 57848
47215 46914 45739 46896
40795 39586 36538 38587
55734 57014 56134 54283
[23940, 35201, 26677, 22212, 31877]

22212

In [260]:
def averageIncomeStates(df):
    tot = 0
    count = 0
    for i in range(len(df.values)):
        for j in range(2,len(df.columns)):
            tot = tot + df.values[i][j]
            count = count + 1
    return tot//count
averageIncomeStates(incomedf)

48525

In [261]:
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [262]:
# State with highest average income in the last three years
def highestAverageIncomeState(df):
    d = {}
    for i in range(len(df.values)):
        d[df.values[i][1]] = (sum(df.values[i][-3:])//3)
    for item in d.items():
        if max(d.values()) == item[1]:
            return item[0]+':'+str(item[1])
highestAverageIncomeState(incomedf)

'Alaska:60738'

In [263]:
print(l[0],l[1])

23940 35201

In [267]:
# State with lowest average income from 2007 to 2010 (inclusive)
    
def lowestAverageIncomeState(df,columnkey1,columnkey2):
    columnindex1 = getcolumnindex(df,columnkey1)
    columnindex2 = getcolumnindex(df,columnkey2)
    print(columnindex1)
    print(columnindex2)
    d = {}
    for i in range(len(df.values)):
        d[df.values[i][1]] = sum(df.values[i][columnindex1:(columnindex2+1)])//(columnindex2-columnindex1+1)
    for item in d.items():
        if min(d.values()) == item[1]:
            return (item[0]+':'+str(item[1]))
        
lowestAverageIncomeState(incomedf,'2007','2010')

4
7

'Arkansas:38876'

In [265]:
c1=getcolumnindex(incomedf,'2005')
c2=getcolumnindex(incomedf,'2013')
print(c1)
print(c2)

2
10

In [266]:
## Numpy to pandas
import numpy as np
h = [[1,2],[3,4]] 
df_h = pd.DataFrame(h)
print('Data Frame:', df_h)

Data Frame:    0  1
0  1  2
1  3  4